src/DataProcessors/СопоставлениеОрганизацийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СопоставлениеОрганизацийЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СоответствиеОрганизацийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеОрганизацийЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/СопоставлениеОрганизацийЕГАИС/Forms/ФормаСопоставленияКонтрагентов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ОрганизацияЕГАИС, Контрагент");
	
	ФактическийАдресКонтрагента = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Контрагент, ТекущаяДата()).ФактическийАдрес;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСоответствие(Команда)
	
	Если ЕстьПредупреждения() Тогда
		ТекстВопроса = НСтр("ru = 'Между связываемыми элементами есть расхождения. Продолжить?'");
		РезультатВопроса = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена,, КодВозвратаДиалога.Отмена);
		ЗаписатьСоответствие_Завершение(КодВозвратаДиалога.ОК, Неопределено);
	Иначе
		ЗаписатьСоответствие_Завершение(КодВозвратаДиалога.ОК, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСоответствие_Завершение(РезультатВопроса, ДополнительныеПараметры)
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСоответствиеНаСервере();
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствиеНаСервере()
	
	Запись = РегистрыСведений.СоответствиеОрганизацийЕГАИС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ЭтаФорма);
	Запись.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.ПредупреждениеИНН.Видимость = НЕ ПустаяСтрока(Контрагент.ИНН) И НЕ ПустаяСтрока(ОрганизацияЕГАИС.ИНН) И СокрЛП(Контрагент.ИНН) <> СокрЛП(ОрганизацияЕГАИС.ИНН);
	Элементы.ПредупреждениеКПП.Видимость = НЕ ПустаяСтрока(Контрагент.КПП) И НЕ ПустаяСтрока(ОрганизацияЕГАИС.КПП) И СокрЛП(Контрагент.КПП) <> СокрЛП(ОрганизацияЕГАИС.КПП);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьПредупреждения()
	
	Возврат Элементы.ПредупреждениеИНН.Видимость ИЛИ Элементы.ПредупреждениеКПП.Видимость;
	
КонецФункции
